; domain
(define (domain signs)
    
    (:requirements :typing :action-costs)

    (:types buffer workplace board shape color)

    (:predicates
        (expert-mode)
        (advanced-mode)

        (in-hand-board ?board - board )
        (in-hand-saw)
        (in-hand-paint)
        (hand-free)
	    
        (at ?x - board ?y - buffer)
        (mounted ?x - board ?y - workplace)
        (empty ?x - workplace)
        
        (cuted ?x - board )
        (has-shape ?x - board ?y - shape)

        (painted ?x - board )
        (has-color ?x - board ?y - color)
    )

    (:functions
        (total-cost)
    )

    (:action pick
        :parameters ( ?board - board ?place - buffer)
        :precondition (and (hand-free) (at ?board ?place))
        :effect (and
            (in-hand-board ?board)
            (not (hand-free))
            (not (at ?board ?place)) ) )

    (:action grasp-saw
        :parameters ()
        :precondition (and (hand-free))
        :effect (and
            (in-hand-saw)
            (not (hand-free))
            (increase (total-cost) 1) ) )

    (:action grasp-paint
        :parameters ()
        :precondition (and (hand-free))
        :effect (and
            (in-hand-paint)
            (not (hand-free))
            (increase (total-cost) 1) ) )

    (:action stash
        :parameters ( ?board - board ?place - buffer)
        :precondition (and (in-hand-board ?board))
        :effect (and
            (not (in-hand-board ?board))
            (hand-free)
            (at ?board ?place) ) )

     (:action do-saw
        :parameters ( ?board - board ?place - workplace ?shape - shape)
        :precondition (and
            (in-hand-saw)
            (mounted ?board ?place)
            (not (cuted ?board)))
        :effect (and
            (cuted ?board)
            (has-shape ?board ?shape)
            (increase (total-cost) 8)) )

     (:action do-paint
        :parameters ( ?board - board ?place - workplace ?color - color)
        :precondition (and
            (in-hand-paint)
            (mounted ?board ?place)
            (cuted ?board)
            (not (painted ?board)))
        :effect (and
            (painted ?board)
            (has-color ?board ?color)
            (increase (total-cost) 12)) )


    (:action drop-saw
        :parameters ()
        :precondition (and (in-hand-saw))
        :effect (and
            (not (in-hand-saw))
            (hand-free)
            (increase (total-cost) 1) ) )

    (:action drop-paint
        :parameters ()
        :precondition (and (in-hand-paint))
        :effect (and
            (not (in-hand-paint))
            (hand-free)
            (increase (total-cost) 1) ) )

    (:action mount
        :parameters ( ?board - board ?place - workplace)
        :precondition (and (in-hand-board ?board) (empty ?place) )
        :effect (and
            (not (in-hand-board ?board))
            (hand-free)
            (mounted ?board ?place)
            (not (empty ?place))
            (increase (total-cost) 4) ) )

    (:action umount
        :parameters ( ?board - board ?place - workplace)
        :precondition (and (hand-free) (mounted ?board ?place) )
        :effect (and
            (in-hand-board ?board)
            (not (hand-free))
            (not (mounted ?board ?place))
            (empty ?place)
            (increase (total-cost) 4) ) )

    (:action switch-advanced
        :parameters ()
        :precondition (and (not (advanced-mode)) (not (expert-mode)))
        :effect (and
            (advanced-mode)
            (increase (total-cost) 15)
        )
    )

    (:action switch-expert
        :parameters ()
        :precondition (and (advanced-mode) (not (expert-mode)))
        :effect (and
            (not (advanced-mode))
            (expert-mode)
            (increase (total-cost) 22)
        )
    )

)

; problem
(define (problem big-problem5)
    (:domain signs)
    (:objects
        buff - buffer
        place1 place2 - workplace
        trigon circle square - shape
        blue yellow red green - color
        board0 board1 board2 board3 board4 board5 - board
    )
    (:init
        (empty place1)
        (empty place2)
        (hand-free)
        (= (total-cost) 0)

        (at board0 buff)
        (at board1 buff)
        (at board2 buff)
        (at board3 buff)
        (at board4 buff)
        (at board5 buff)
    )
    (:goal
        (and
            (at board0 buff)
            (at board1 buff)
            (at board2 buff)
            (at board3 buff)
            (at board4 buff)
            (at board5 buff)

            (has-color board0 red)
            (has-color board1 blue)
            (has-color board2 red)
            (has-color board3 red)
            (has-color board4 red)
            (has-color board5 red)

            (has-shape board0 trigon)
            (has-shape board1 circle)
            (has-shape board2 square)
            (has-shape board3 square)
            (has-shape board4 square)
            (has-shape board5 trigon)
        )
    )
    (:metric minimize (total-cost))
)

; plan
1. (pick board1 buff)
   deleted: (hand-free) (at board1 buff)
   added: (in-hand-board board1)
   goals met: 5 of 18
2. (mount board1 place1)
   deleted: (in-hand-board board1) (empty place1)
   added: (hand-free) (mounted board1 place1)
   goals met: 5 of 18
3. (pick board4 buff)
   deleted: (hand-free) (at board4 buff)
   added: (in-hand-board board4)
   goals met: 4 of 18
4. (mount board4 place2)
   deleted: (in-hand-board board4) (empty place2)
   added: (hand-free) (mounted board4 place2)
   goals met: 4 of 18
5. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 4 of 18
6. (do-saw board1 place1 circle)
   added: (cuted board1) (has-shape board1 circle)
   goals met: 5 of 18
7. (do-saw board4 place2 square)
   added: (cuted board4) (has-shape board4 square)
   goals met: 6 of 18
8. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 6 of 18
9. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 6 of 18
10. (do-paint board4 place2 red)
   added: (painted board4) (has-color board4 red)
   goals met: 7 of 18
11. (do-paint board1 place1 blue)
   added: (painted board1) (has-color board1 blue)
   goals met: 8 of 18
12. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 8 of 18
13. (umount board1 place1)
   deleted: (hand-free) (mounted board1 place1)
   added: (in-hand-board board1) (empty place1)
   goals met: 8 of 18
14. (stash board1 buff)
   deleted: (in-hand-board board1)
   added: (hand-free) (at board1 buff)
   goals met: 9 of 18
15. (pick board2 buff)
   deleted: (hand-free) (at board2 buff)
   added: (in-hand-board board2)
   goals met: 8 of 18
16. (mount board2 place1)
   deleted: (in-hand-board board2) (empty place1)
   added: (hand-free) (mounted board2 place1)
   goals met: 8 of 18
17. (umount board4 place2)
   deleted: (hand-free) (mounted board4 place2)
   added: (in-hand-board board4) (empty place2)
   goals met: 8 of 18
18. (stash board4 buff)
   deleted: (in-hand-board board4)
   added: (hand-free) (at board4 buff)
   goals met: 9 of 18
19. (pick board5 buff)
   deleted: (hand-free) (at board5 buff)
   added: (in-hand-board board5)
   goals met: 8 of 18
20. (mount board5 place2)
   deleted: (in-hand-board board5) (empty place2)
   added: (hand-free) (mounted board5 place2)
   goals met: 8 of 18
21. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 8 of 18
22. (do-saw board5 place2 trigon)
   added: (cuted board5) (has-shape board5 trigon)
   goals met: 9 of 18
23. (do-saw board2 place1 square)
   added: (cuted board2) (has-shape board2 square)
   goals met: 10 of 18
24. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 10 of 18
25. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 10 of 18
26. (do-paint board5 place2 red)
   added: (painted board5) (has-color board5 red)
   goals met: 11 of 18
27. (do-paint board2 place1 red)
   added: (painted board2) (has-color board2 red)
   goals met: 12 of 18
28. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 12 of 18
29. (umount board5 place2)
   deleted: (hand-free) (mounted board5 place2)
   added: (in-hand-board board5) (empty place2)
   goals met: 12 of 18
30. (stash board5 buff)
   deleted: (in-hand-board board5)
   added: (hand-free) (at board5 buff)
   goals met: 13 of 18
31. (pick board3 buff)
   deleted: (hand-free) (at board3 buff)
   added: (in-hand-board board3)
   goals met: 12 of 18
32. (mount board3 place2)
   deleted: (in-hand-board board3) (empty place2)
   added: (hand-free) (mounted board3 place2)
   goals met: 12 of 18
33. (umount board2 place1)
   deleted: (hand-free) (mounted board2 place1)
   added: (in-hand-board board2) (empty place1)
   goals met: 12 of 18
34. (stash board2 buff)
   deleted: (in-hand-board board2)
   added: (hand-free) (at board2 buff)
   goals met: 13 of 18
35. (pick board0 buff)
   deleted: (hand-free) (at board0 buff)
   added: (in-hand-board board0)
   goals met: 12 of 18
36. (mount board0 place1)
   deleted: (in-hand-board board0) (empty place1)
   added: (hand-free) (mounted board0 place1)
   goals met: 12 of 18
37. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 12 of 18
38. (do-saw board3 place2 square)
   added: (cuted board3) (has-shape board3 square)
   goals met: 13 of 18
39. (do-saw board0 place1 trigon)
   added: (cuted board0) (has-shape board0 trigon)
   goals met: 14 of 18
40. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 14 of 18
41. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 14 of 18
42. (do-paint board3 place2 red)
   added: (painted board3) (has-color board3 red)
   goals met: 15 of 18
43. (do-paint board0 place1 red)
   added: (painted board0) (has-color board0 red)
   goals met: 16 of 18
44. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 16 of 18
45. (umount board3 place2)
   deleted: (hand-free) (mounted board3 place2)
   added: (in-hand-board board3) (empty place2)
   goals met: 16 of 18
46. (stash board3 buff)
   deleted: (in-hand-board board3)
   added: (hand-free) (at board3 buff)
   goals met: 17 of 18
47. (umount board0 place1)
   deleted: (hand-free) (mounted board0 place1)
   added: (in-hand-board board0) (empty place1)
   goals met: 17 of 18
48. (stash board0 buff)
   deleted: (in-hand-board board0)
   added: (hand-free) (at board0 buff)
   goals met: 18 of 18
